In [3]:
import pandas as pd

perk_level_df = pd.read_csv("/Users/biancaniemann/Documents/VS Code/Practice Python/Travel Tide Project/TravelTide_Final_Files/user_level_df_incl_perk_segments.csv")

In [2]:
!pip install -q pandasql
from pandasql import sqldf
pysqldf = lambda q: sqldf(q, globals())

In [14]:
# Check the average hotel spent for midlife to check I am using correct info on tableau
query = """
WITH test_table AS (
    SELECT sum_hotel_cost_per_room_per_night, avg_hotel_cost_per_room_per_night,
        SUM(sum_hotel_cost_per_room_per_night) OVER() AS 'test' 
    FROM perk_level_df
    WHERE segmentation = 'Mid-Life Traveller'
)
SELECT test/COUNT(*) AS avg_hotel_rate
FROM test_table

"""
result = pysqldf(query)
result

   avg_hotel_rate
0      518.259833

In [22]:
# Check the average checked-bags
query = """
WITH test_table AS (
    SELECT segmentation, SUM(sum_checked_bags) as 'total_bags', count(segmentation) as 'seg'
    FROM perk_level_df
    GROUP BY segmentation
)
SELECT segmentation, total_bags, seg, total_bags/seg AS avg
FROM test_table
"""
result = pysqldf(query)
result

         segmentation  total_bags   seg       avg
0    Family Traveller      2361.0  1776  1.329392
1  Mid-Life Traveller      3879.0  2390  1.623013
2             No Perk         0.0    64  0.000000
3   Not traveller Yet         0.0   492  0.000000
4    Senior Traveller       224.0   285  0.785965
5     Young Traveller      1051.0   991  1.060545

In [49]:
# 
query = """

    SELECT MAX(sum_hotel_cost_total), AVG(sum_hotel_cost_total), MAX(sum_flights_cost ), AVG(sum_flights_cost ), MAX(trips_booked) ,MAX(total_flights_transactions),AVG(total_flights_transactions), MAX(total_hotel_transactions), AVG(total_hotel_transactions)
    FROM perk_level_df
    WHERE segmentation = 'Mid-Life Traveller'

"""
result = pysqldf(query)
result

,MAX(sum_hotel_cost_total),AVG(sum_hotel_cost_total),MAX(sum_flights_cost ),AVG(sum_flights_cost ),MAX(trips_booked),MAX(total_flights_transactions),AVG(total_flights_transactions),MAX(total_hotel_transactions),AVG(total_hotel_transactions)
0,28114.0,2480.433473,7481.72,1275.952669,8,16,5.756485,7,2.943515

In [55]:
# 
query = """

    SELECT COUNT(*) 
    FROM perk_level_df
    WHERE segmentation = 'Mid-Life Traveller'
        AND (sum_hotel_cost_total + sum_flights_cost ) <= 3000
"""
result = pysqldf(query)
result

   COUNT(*)
0      1109

In [57]:
# 
query = """

    SELECT COUNT(*) 
    FROM perk_level_df
    WHERE segmentation = 'Mid-Life Traveller'
        AND (sum_hotel_cost_total + sum_flights_cost ) > 3000
"""
result = pysqldf(query)
result

   COUNT(*)
0      1281

In [66]:
# 
query = """

    SELECT COUNT(*) 
    FROM perk_level_df
    WHERE segmentation = 'Mid-Life Traveller'
        AND avg_flight_discount_amount = 0
"""
result = pysqldf(query)
result

   COUNT(*)
0      1459

In [67]:
# 
query = """

    SELECT COUNT(*) 
    FROM perk_level_df
    WHERE segmentation = 'Mid-Life Traveller'
        AND avg_flight_discount_amount > 0
"""
result = pysqldf(query)
result

   COUNT(*)
0       931

In [59]:
# 
query = """

    SELECT max(avg_hotel_discount_amount), MAX(avg_flight_discount_amount)
    FROM perk_level_df
    WHERE segmentation = 'Mid-Life Traveller'
    
"""
result = pysqldf(query)
result

   max(avg_hotel_discount_amount)  MAX(avg_flight_discount_amount)
0                            0.45                              0.5